Repository: Ryu-nakay/flashcard_app_var6
Catalog: lib/l10n/app_*.arb
Languages: es, hi, ja, zh

# number_of_cards
source: Number of cards: {cards_count}
es: Número de tarjetas: {cards_count}
hi: कार्डों की संख्या: {cards_count}
ja: カード数：{cards_count}枚
zh: 卡片数量：{cards_count}

# front_to_back
source: Front→Back
es: anverso→parte trasera
hi: सामने की ओर→पीछे की ओर
ja: おもて→うら
zh: 前面→背面

# back_to_front
source: Back→Front
es: parte trasera→anverso
hi: पीछे की ओर→सामने की ओर
ja: うら→おもて
zh: 背面→前面

source: Random
es: aleatorio
hi: यादृच्छिक रूप से
ja: ランダム
zh: 随机的

source: In order
es: En orden
hi: क्रम में
ja: 順番通り
zh: 为了

source: START
es: comienzo
hi: शुरु
ja: スタート
zh: 开始

source: Select how to create a memorization card
es: Elige cómo crear una tarjeta de memorización
hi: याद रखने वाला कार्ड बनाने का तरीका चुनें
ja: 暗記カードの作成方法を選択
zh: 选择如何创建记忆卡

source: Manual
hi: हाथ से किया हुआ
ja: 手動
zh: 手动的

# cancel_en
source: Cancel
es: Cancelar
hi: रद्द करें
zh: 取消

source: Select an operation
es: Seleccione una operación
hi: कृपया एक ऑपरेशन चुनें
ja: 操作を選択
zh: 请选择一个操作

source: Edit memorization card
es: Editar tarjeta de memorización
hi: यादगार कार्ड संपादित करें
ja: 暗記カードを編集
zh: 编辑记忆卡

# delete_are_you_sure_you_want_to
source: Delete are you sure want to?
es: Eliminar ¿Estás seguro de que quieres?
hi: हटाएं क्या आप वाकई चाहते हैं
ja: 削除してもよろしいですか？
zh: 删除确定要删除吗？

source: Cannot be restored.
es: No se puede restaurar.
hi: इसे बहाल नहीं किया जा सकता है।
ja: 復元することはできません。
zh: 它无法恢复。

source: Delete
es: Borrar
hi: हटाएं
ja: 削除
zh: 删除

# cancel
source: Cnacel
es: Cancelar
hi: रद्द करें
ja: キャンセル
zh: 取消

source: settings
es: ajuste
hi: स्थापना
ja: setting
zh: 环境

source: Theme change
es: cambiar el tema
hi: थीम परिवर्तन
ja: テーマ変更
zh: 主题变化

source: Current color:
es: color actual
hi: वर्तमान रंग
ja: 現在のカラー
zh: 当前颜色

# color_to_be_chaged
source: Color to be changed:
es: Color a cambiar
hi: रंग बदलना होगा
ja: 変更予定の色
zh: 要更改的颜色

source: Close
es: de cerca
hi: क्लोज़ अप
ja: 閉じる
zh: 特写

source: Choose a color
es: Elige un color
hi: कोई रंग चुनें
ja: 色を選択
zh: 选择一种颜色

source: Apply
es: Solicitud
hi: आवेदन
ja: 適用
zh: 应用

source: Click here for app opinions, impressions, and bug reports
es: Haga clic aquí para obtener opiniones, impresiones e informes de errores de la aplicación
hi: ऐप राय, इंप्रेशन और बग रिपोर्ट के लिए यहां क्लिक करें
ja: アプリの意見や感想、バグの報告はこちら
zh: 单击此处查看应用意见、印象和错误报告

source: Producer's Twitter
es: Twitter del creador:
hi: निर्माता का ट्विटर:
ja: 製作者 Twitter:
zh: 创作者的推特:

source: Could not open Twitter:
es: No se pudo abrir Twitter
hi: ट्विटर नहीं खोल सका
ja: Twitterを開くことができませんでした
zh: 无法打开推特

source: Something went wrong and it failed. Please try again in a good communication environment
es: Algo salió mal y falló. Vuelva a intentarlo en un buen entorno de comunicación.
hi: कुछ गलत हो गया और यह विफल हो गया। कृपया एक अच्छे संचार वातावरण में पुन: प्रयास करें।
ja: 何らかの不具合が生じ失敗しました。 良い通信環境で再度お試しください。
zh: 出了点问题，它失败了。 请在良好的通讯环境中重试。

source: OK
hi: ठीक है
zh: 行

source: front:
es: anverso:
hi: सामने की ओर:
ja: おもて:
zh: 前面:

source: Enter the word to be displayed on the front
es: Ingrese la palabra que se mostrará en el anverso
hi: सामने की तरफ प्रदर्शित होने वाला शब्द दर्ज करें
ja: おもてに表示する単語を入力
zh: 输入要在前面显示的单词

source: front memo:
es: Nota del anverso:
hi: फ्रंट साइड मेमो:
ja: おもてメモ:
zh: 正面备忘录:

source: Enter the word to be displayed on the front memo
es: Ingrese la nota que se mostrará en el anverso
hi: सामने की तरफ प्रदर्शित होने वाला मेमो दर्ज करें
ja: おもてメモに表示するメモを入力
zh: 输入要在正面显示的备忘录

source: back:
es: parte trasera:
hi: पीछे की ओर:
ja: うら:
zh: 背面:

source: Enter the word to be displayed on the back
es: Haz las palabras para mostrar en la parte posterior.
hi: पीछे की ओर प्रदर्शित होने वाला शब्द दर्ज करें
ja: うらに表示する単語を入力
zh: 输入要在背面显示的单词

source: back memo:
es: Nota en la parte posterior:
hi: पीठ पर नोट:
ja: うらメモ:
zh: 背面备注:

source: Enter the word to be displayed on the back memo
es: Ingrese la nota que se mostrará en el reverso
hi: पीछे की ओर प्रदर्शित होने वाला मेमो दर्ज करें
ja: うらメモに表示するメモを入力
zh: 输入要在背面显示的备忘录

# create_and_edit
source: Create/Edit
es: Crear / Editar
hi: बनाएं / संपादित करें
ja: 作成・編集
zh: 创建/编辑

source: name:
es: nombre:
hi: नाम:
ja: 名前:
zh: 名称:

source: Enter the memorization card name
es: Introduzca el nombre de la tarjeta de memorización
hi: मेमोराइज़ेशन कार्ड का नाम दर्ज करें
ja: 暗記カード名を入力
zh: 请输入记忆卡名称

# saved_the_memorization_card
source: Saved the {memorization_card_name}
es: Guardado {memorization_card_name}.
hi: सहेजा गया {memorization_card_name}.
ja: {memorization_card_name}を保存しました。
zh: 已保存 {memorization_card_name}。

source: Could not save.
es: No se pudo guardar.
hi: सहेज नहीं सका।
ja: 保存できませんでした。
zh: 无法保存。

source: You need at least one non-blank card.
es: Necesita al menos una tarjeta que no esté en blanco.
hi: आपको कम से कम एक गैर-रिक्त कार्ड की आवश्यकता है।
ja: 白紙でないカードが1枚以上必要です。
zh: 您至少需要一张非空白卡。

source: Save and Return.
es: Guardar y volver
hi: सहेजें और वापस लौटें
ja: セーブして戻る
zh: 保存并返回

source: My page
es: Mi página
hi: मेरा पेज
zh: 我的页面

source: TOTAL DATA
es: Datos totales
hi: कुल डेटा
ja: 総データ
zh: 总数据

source: Learning situation
es: situación de aprendizaje
hi: सीखने की स्थिति
ja: 学習状況
zh: 学习情况

source: Enter memo
es: Introducir notas
hi: कृपया एक नोट दर्ज करें
ja: メモを入力
zh: 请输入备注

source: Learning level
es: Nivel de aprendizaje
hi: सीखने का स्तर
ja: 学習レベル
zh: 学习水平
